diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаАктов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	 ДлительнаяОперация = НачатьСозданиеАктов();
	 
	 ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	 Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСозданияАктов", ЭтотОбъект);
	 ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьСозданиеАктов()
	
	Объект.ТаблицаАктов.Очистить();
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
	 "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьАктыЗаПериод",
	 Объект.Период.ДатаНачала,
	 Объект.Период.ДатаОкончания);
	 
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииСозданияАктов(Результат, ДополнительныеПараметры) Экспорт

	 Если Результат = Неопределено Тогда // Пользователь отменил задание.
	  	Возврат;
	 КонецЕсли;
	 
	 Если Результат.Статус = "Ошибка" Тогда
	 	 ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	 КонецЕсли;
 
	МассивАктов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если МассивАктов.Количество() > 0 тогда
		ЗаполнитьТаблицуАктовНаСервере(МассивАктов);
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуАктовНаСервере(МассивАктов)
	
	Для каждого ЭлМассив из МассивАктов цикл
	
		НС = Объект.ТаблицаАктов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ЭлМассив);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
